iotsmartsys/IoTSmartSysCore/src/Platform/Espressif/Pinouts/SmartSys_ESP32_S3_Dev_Board_Pinouts.h
#pragma once

#include "sdkconfig.h"

#ifdef SMARTSYS_ESP32S3_DEV_BOARD
#if CONFIG_IDF_TARGET_ESP32S3
#include "ESP32_S3_Pinouts.h"

#define SMARTSYS_DEV_BOARD_BOOT_PIN ESP32_GPIO0
#define SMARTSYS_DEV_BOARD_LED_GREEN_PIN ESP32_LED_GREEN_GPIO43
#define SMARTSYS_DEV_BOARD_LED_BLUE_PIN ESP32_LED_BLUE_GPIO44
#define SMARTSYS_DEV_BOARD_ALARM_PIN ESP32_SAFE_GPIO6
#define SMARTSYS_DEV_BOARD_TSOP_PIN ESP32_SAFE_GPIO7
#define SMARTSYS_DEV_BOARD_REED_SWITCH_PIN ESP32_SAFE_GPIO5
#define SMARTSYS_DEV_BOARD_DHT11_PIN ESP32_SAFE_GPIO4
#define SMARTSYS_DEV_BOARD_ULTRASONIC_TRIG_PIN ESP32_SAFE_GPIO15
#define SMARTSYS_DEV_BOARD_ULTRASONIC_ECHO_PIN ESP32_SAFE_GPIO16
#define SMARTSYS_DEV_BOARD_IR_EMITTER_PIN ESP32_SAFE_GPIO10
#define SMARTSYS_DEV_BOARD_PIR_SENSOR_PIN ESP32_SAFE_GPIO11
#define SMARTSYS_DEV_BOARD_BH1750_SCL_PIN ESP32_SCL
#define SMARTSYS_DEV_BOARD_BH1750_SDA_PIN ESP32_SDA
#endif // SMARTSYS_ESP32_DEV_BOARD
#endif // CONFIG_IDF_TARGET_ESP32S3